<footer class="footer-container container-fluid py-3">
    <div class="container">
        <div class="row">
            <!-- Sección de texto de derechos reservados -->
            <div class="col-md-4 text-center">
                <p class="mb-0">&copy; 2024 Departamento Nacional de Planeación </p>
            </div>

            <!-- Enlace para Términos y Condiciones -->
            <div class="col-md-4 text-center">
                <a href="#disclaimerModal" class="text-secondary text-decoration-none" data-bs-toggle="modal">
                    Términos y condiciones de uso
                </a>
            </div>

            <!-- Botones de navegación -->
            <div class="col-md-4 d-flex flex-column flex-md-row justify-content-md-end align-items-md-center">
                <!-- Botones para navegación -->
                <div class="btn-group mb-2 mb-md-0" role="group" aria-label="Navegación del pie de página">
                    <a href="index.html" class="btn btn-outline-secondary btn-sm">Inicio</a>
                    <a href="arbol.html" class="btn btn-outline-secondary btn-sm">Árbol de decisión</a>
                    <a href="catalogo.html" class="btn btn-outline-secondary btn-sm">Catálogo</a>
                    <a href="guia.html" class="btn btn-outline-secondary btn-sm">Guía</a>
                </div>
            </div>
        </div>

    </div>
</footer>

<!-- Modal de Términos y Condiciones -->
<div class="modal fade" id="disclaimerModal" tabindex="-1" aria-labelledby="disclaimerModalLabel" aria-hidden="true">
    <div class="modal-dialog modal-fullscreen">
        <div class="modal-content">
            <!-- Encabezado del modal -->
            <div class="modal-header">
                <h5 class="modal-title" id="disclaimerModalLabel">Términos y condiciones de uso</h5>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Cerrar"></button>
            </div>
            
            <!-- Cuerpo del modal -->
            <div class="modal-body">
                <h1>T&eacute;rminos y Condiciones de Uso</h1>
                <p>
                    El Departamento Nacional de Planeaci&oacute;n (DNP) pone a disposici&oacute;n esta gu&iacute;a de buenas pr&aacute;cticas, el cat&aacute;logo de herramientas y el &aacute;rbol de decisi&oacute;n como recursos de referencia para fomentar la inclusi&oacute;n y la equidad de g&eacute;nero en el desarrollo y uso de sistemas de inteligencia artificial (IA). La informaci&oacute;n contenida tiene fines informativos y orientativos, y no constituye asesoramiento t&eacute;cnico, legal o profesional, ni sustituye ninguna ley o regulaci&oacute;n vigente.
                </p>
                <p>
                    Aunque se han realizado esfuerzos significativos para garantizar la calidad y precisi&oacute;n del contenido presentado, el DNP no garantiza la exactitud, idoneidad o actualidad de los datos o informaciones publicadas, ni puede garantizar ni verificar la validez o integridad de la informaci&oacute;n proporcionada por terceros. El DNP no asume responsabilidad alguna por errores, omisiones o resultados derivados de la interpretaci&oacute;n, recopilaci&oacute;n o uso de estos recursos. Tampoco asume responsabilidad frente a la disponibilidad de la gu&iacute;a de buenas pr&aacute;cticas, el cat&aacute;logo de herramientas y/o el &aacute;rbol de decisi&oacute;n o su informaci&oacute;n.
                </p>

                <h2>Responsabilidad del Usuario</h2>
                <p>
                    La implementaci&oacute;n de buenas pr&aacute;cticas, herramientas y/o decisiones basadas en el &aacute;rbol de decisi&oacute;n queda bajo la exclusiva responsabilidad del usuario. Es responsabilidad del usuario verificar que las decisiones y/o herramientas se ajusten a las normativas aplicables en su jurisdicci&oacute;n, as&iacute; como a los objetivos espec&iacute;ficos de su contexto, siendo el &uacute;nico responsable de su ejecuci&oacute;n y/o utilizaci&oacute;n.
                </p>

                <h2>Sobre las Herramientas Relacionadas y Metodolog&iacute;a</h2>
                <p>
                    El cat&aacute;logo incluye herramientas desarrolladas y gestionadas por terceros independientes, perteneciendo exclusivamente a sus correspondientes titulares o autores. La selecci&oacute;n de estas herramientas se ha desarrollado tras llevar a cabo un mapeo exhaustivo, considerando su relevancia, vigencia y aplicaci&oacute;n en los temas de IA y equidad de g&eacute;nero. El DNP no ejerce control alguno sobre las herramientas presentadas en el cat&aacute;logo, ni realiza evaluaciones o pruebas de las mismas.
                </p>
                <p>
                    En el caso en que se haga referencia a una o varias herramientas en particular, se entiende se utiliza como un refuerzo educativo y conceptual, mas no se genera a manera de aval o aprobaci&oacute;n de la herramienta seleccionada por parte de la entidad, sus agentes o funcionarios.
                </p>
                <p>
                    Es responsabilidad del usuario validar la pertinencia, la seguridad, y el cumplimiento normativo de dichas herramientas antes de su implementaci&oacute;n. El DNP no se hace responsable por cualquier perjuicio causado, directa o indirectamente, de la publicaci&oacute;n de los enlaces a las herramientas publicadas en el cat&aacute;logo.
                </p>

                <h2>Sobre la Propiedad Intelectual de Terceros</h2>
                <p>
                    Todos los contenidos susceptibles de derechos de autor, signos distintivos, dise&ntilde;os industriales, nuevas creaciones, secreto comercial o cualquier otro derecho protegido por las normas de Propiedad Intelectual mencionados, citados o incluidos de cualquier modo en la gu&iacute;a de buenas pr&aacute;cticas, el cat&aacute;logo de herramientas y el &aacute;rbol de decisi&oacute;n pertenecen a sus respectivos creadores y titulares.
                </p>
                <p>
                    La menci&oacute;n, inclusi&oacute;n o uso de estos en la gu&iacute;a de buenas pr&aacute;cticas, el cat&aacute;logo de herramientas y el &aacute;rbol de decisi&oacute;n, no constituye una licencia de uso o explotaci&oacute;n, as&iacute; como ninguna transferencia de derechos. En este sentido, como usuario se compromete a no utilizarlos para ning&uacute;n otro fin entendiendo que los titulares de derechos no respaldan, avalan o se encuentran afiliados al DNP, por lo que la entidad no se encuentra autorizada para conceder ning&uacute;n tipo de derecho, uso o explotaci&oacute;n respecto de los contenidos susceptibles de protecci&oacute;n mencionados.
                </p>

                <h2>Recomendaci&oacute;n Adicional</h2>
                <p>
                    Se recomienda realizar evaluaciones t&eacute;cnicas, legales y &eacute;ticas adicionales para asegurar que las pr&aacute;cticas y herramientas adoptadas sean adecuadas y conformes a las regulaciones aplicables. En caso de duda, se aconseja buscar asesoramiento profesional especializado.
                </p>

                <h2>Alcance del Aviso Legal</h2>
                <p>
                    Este aviso no constituye un acuerdo vinculante entre las partes y est&aacute; sujeto a actualizaciones peri&oacute;dicas. El uso de los recursos proporcionados implica la aceptaci&oacute;n plena de estos t&eacute;rminos.
                </p>
            </div>
            
            <!-- Pie del modal -->
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">Cerrar</button>
            </div>
        </div>
    </div>
</div>
